SigninLogs
| where UserPrincipalName contains "UserName"

#------------------

# Basic Query

SigninLogs
| where UserPrincipalName contains "admin.bag"
| project TimeGenerated, AppDisplayName,ClientAppUsed, IPAddress, Location, RiskState, AuthenticationDetails, ResultDescription, Status

#----

# Get Successful Sign-ins outside of Switzerland

SigninLogs
| where UserPrincipalName contains "wyrsch"
| project TimeGenerated, UserPrincipalName, AppDisplayName,ClientAppUsed, IPAddress, Location, RiskState, AuthenticationDetails, ResultDescription, Status
| where AuthenticationDetails contains "True"
| where Location !contains "CH"

#----

# Get Successful Sign-ins outside of Switzerland for the whole company

SigninLogs
| where UserPrincipalName endswith "achtgradost.ch"
| project TimeGenerated, UserDisplayName, AppDisplayName,ClientAppUsed, IPAddress, Location, RiskState, AuthenticationDetails, ResultDescription, Status
| where AuthenticationDetails contains "True"
| where Location !contains "CH"